-- テーブル作成
CREATE TABLE StudentClub (
    student_no      INT,
    club_id         INT,
    club_name       VARCHAR(50),
    main_club_flag  CHAR(1)
);

-- データ投入
INSERT INTO StudentClub
    (student_no, club_id, club_name, main_club_flag)
VALUES
    (1001, 1, '野球部',       'N'),
    (1002, 2, 'サッカー部',   'N'),

    -- 掛け持ち（テニス部が主）
    (1003, 3, 'テニス部',     'Y'),
    (1003, 4, '軽音部',       'N'),

    -- 掛け持ち（吹奏楽部が主）
    (1004, 5, '吹奏楽部',     'Y'),
    (1004, 6, '写真部',       'N'),

    (1005, 7, 'バスケット部', 'N'),

    -- 掛け持ち（バレー部が主）
    (1006, 8, 'バレー部',     'Y'),
    (1006, 9, '将棋部',       'N'),

    (1007, 10, '美術部',      'N'),
	(1008, 1, '野球部',       'N'),
    (1009, 1, '野球部',       'N'),

    (1010, 2, 'サッカー部',   'N'),
    (1011, 2, 'サッカー部',   'N'),

    (1012, 3, 'テニス部',     'N'),

    (1013, 5, '吹奏楽部',     'N'),

    (1014, 7, 'バスケット部', 'N'),

    (1015, 10, '美術部',      'N');